campaignTrail_temp.questions_json = [{
    "pk": 4003,
    "priority": 1,
    "description": "You have won the Democratic nomination after a hard-fought primary campaign. How will you approach the general election against the Republican nominee?",
    "likelihood": 1
}, {
    "pk": 4004,
    "priority": 2,
    "description": "As a self-proclaimed democratic socialist, you have faced criticism from some quarters for your political views. How do you plan to address these concerns during the general election?",
    "likelihood": 1
}, {
    "pk": 4005,
    "priority": 3,
    "description": "As a candidate, you have built a diverse coalition of supporters, but some demographics have been more supportive of you than others. Which demographics will you focus on during the general election?",
    "likelihood": 1
}, {
    "pk": 4006,
    "priority": 4,
    "description": "You have chosen JB Pritzker, the billionaire governor of Illinois, as your running mate. What was your reasoning for this choice?",
    "likelihood": 1
}, {
    "pk": 4007,
    "priority": 5,
    "description": "You have faced criticism for not being a moderate candidate and for proposing radical policies such as Medicare for All. How do you respond to this criticism?",
    "likelihood": 1
}, {
    "pk": 4008,
    "priority": 6,
    "description": "President Trump has faced criticism for his handling of the COVID-19 pandemic, including his response to the outbreak and his administration's efforts to control the spread of the virus. How do you plan to address this issue on the campaign trail?",
    "likelihood": 1
}, {
    "pk": 4009,
    "priority": 7,
    "description": "Your campaign has said that it will focus resources on key states and regions in order to win the election. Can you provide more information on which states and regions those are?",
    "likelihood": 1
}]

campaignTrail_temp.answers_json = [{
    "model": "campaign_trail.answer",
    "pk": 8010,
    "fields": {
        "question": 4003,
        "description": "I will continue to campaign on my signature issues, such as universal healthcare and reducing income inequality, and challenge the Republican nominee to defend their record and positions."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8011,
    "fields": {
        "question": 4003,
        "description": "I will focus on unifying the Democratic Party and reaching out to voters who may not have supported me in the primary, in order to build a broad coalition for the general election."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8012,
    "fields": {
        "question": 4003,
        "description": "I will highlight the ways in which the Republican nominee is out of touch with the needs and concerns of ordinary Americans, and make the case for why I am the better choice for President."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8013,
    "fields": {
        "question": 4003,
        "description": "I will present myself as a candidate of change, and argue that only by electing a progressive like me can we address the major challenges facing our country."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8014,
    "fields": {
        "question": 4004,
        "description": "I will explain what democratic socialism means to me, and how it is different from the authoritarian socialism of the Soviet Union or other countries. I will also emphasize the ways in which my policies will benefit the vast majority of Americans."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8015,
    "fields": {
        "question": 4004,
        "description": "I will focus on the issues that matter most to voters, such as healthcare, education, and the economy, and argue that my political beliefs are a means to achieving these goals."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8016,
    "fields": {
        "question": 4004,
        "description": "I will highlight the ways in which countries with more socialist policies, such as Scandinavia, have succeeded in providing a high quality of life for their citizens, and argue that these policies can work in the United States as well."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8017,
    "fields": {
        "question": 4004,
        "description": "I will point to the long history of socialist and progressive movements in the United States, and argue that my beliefs are firmly rooted in American values of fairness and equality."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8018,
    "fields": {
        "question": 4005,
        "description": "I will focus on energizing and mobilizing my base of support among younger voters, as well as communities of color and progressive activists."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8019,
    "fields": {
        "question": 4005,
        "description": "I will emphasize the ways in which my policies will benefit working-class Americans of all backgrounds, and make the case for why I am the candidate of the 99%."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8020,
    "fields": {
        "question": 4005,
        "description": "I will reach out to traditionally Republican-leaning voters, such as independents and disaffected conservatives, and make the case for why they should support me instead of the GOP nominee."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8021,
    "fields": {
        "question": 4005,
        "description": "I will focus on building a coalition of supporters across all demographic groups, and argue that only by coming together can we defeat the Republican nominee and bring about real change."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8022,
    "fields": {
        "question": 4006,
        "description": "Governor Pritzker is a successful businessman and philanthropist who has a track record of getting things done, and I believe he will be an asset to our campaign and our administration."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8023,
    "fields": {
        "question": 4006,
        "description": "Governor Pritzker is a progressive leader who shares many of my beliefs and values, and I believe we will make a strong team in the fight for a better future for all Americans."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8024,
    "fields": {
        "question": 4006,
        "description": "Governor Pritzker has a deep understanding of the challenges facing the Midwest, and I believe he will be a valuable ally in our efforts to win over voters in this key region."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8025,
    "fields": {
        "question": 4006,
        "description": "Governor Pritzker has a proven record of standing up to Donald Trump and the Republican Party, and I believe he will be an effective counterpoint to their attacks on our campaign."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8026,
    "fields": {
        "question": 4007,
        "description": "I believe that the time for bold, transformative change is now. The problems we face as a country, from the high cost of healthcare to income inequality, cannot be solved by incremental, half-measure solutions. That's why I am proposing bold policies like Medicare for All, which will provide high-quality healthcare to all Americans while also lowering costs and improving access."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8027,
    "fields": {
        "question": 4007,
        "description": "I understand that my proposals may be seen as radical by some, but I believe they are necessary to address the challenges we face as a country. And I am confident that when voters hear the details of my plans, they will see that they are based on common sense and fairness, and will support them."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8028,
    "fields": {
        "question": 4007,
        "description": "I don't see myself as a radical candidate, but rather as a candidate who is willing to take bold action to address the urgent problems facing our country. I believe that my proposals, such as Medicare for All, will benefit the American people by providing them with better healthcare and more economic security, and I will continue to make the case for them on the campaign trail."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8029,
    "fields": {
        "question": 4007,
        "description": "I don't shy away from the label of being a 'radical' candidate, because I believe that the challenges we face as a country require radical solutions. Medicare for All may seem radical to some, but it is actually a common-sense solution to a broken healthcare system that leaves millions uninsured and unable to afford the care they need. I will continue to fight for bold policies that will improve the lives of all Americans."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8030,
    "fields": {
        "question": 4008,
        "description": "I believe that the Trump administration's response to the COVID-19 pandemic has been inadequate and misguided. They have failed to provide the necessary leadership and support to state and local officials, and have prioritized their own political interests over the health and safety of the American people. I will make this a key issue in my campaign, and will lay out a clear plan for how I will handle the pandemic if I am elected president."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8031,
    "fields": {
        "question": 4008,
        "description": "The COVID-19 pandemic has exposed the profound failings of the Trump administration and the need for new leadership in the White House. I will make it a priority in my campaign to address this issue and to provide a vision for how I will handle the pandemic if I am elected president. My plan will focus on supporting state and local officials, providing resources and assistance to those affected by the virus, and implementing effective measures to control the spread of the virus."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8032,
    "fields": {
        "question": 4008,
        "description": "The Trump administration's response to the COVID-19 pandemic has been a disaster, and it has cost countless lives and caused immense suffering. I will make it a central focus of my campaign to hold President Trump accountable for his failures and to provide a better, more effective approach to handling the pandemic. My plan will prioritize science and public health, and will prioritize the needs of the American people over politics and self-interest."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8033,
    "fields": {
        "question": 4008,
        "description": "The COVID-19 pandemic has highlighted the need for strong, competent leadership in the White House, and I believe that President Trump has failed to provide that leadership. I will make this a key issue in my campaign, and will provide a detailed plan for how I will handle the pandemic if I am elected president. My plan will focus on providing support and assistance to those affected by the virus, and will prioritize the health and safety of the American people."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8034,
    "fields": {
        "question": 4009,
        "description": "Our campaign is focused on winning key states and regions that will be crucial in determining the outcome of the election. Some of these states include Michigan, Wisconsin, and Pennsylvania, which were crucial to President Trump's victory in 2016 and will be important in the upcoming election. We are also focusing on the Midwest and the Rust Belt, where our message of economic justice and political reform will resonate with voters."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8035,
    "fields": {
        "question": 4009,
        "description": "We believe that the key to winning the election is to focus our resources on states and regions that are critical to our electoral strategy. That includes states like Florida and North Carolina, which have large and diverse populations and will be crucial in determining the outcome of the election. We are also focusing on the Southwest and the Mountain West, where our message of economic justice and political reform will resonate with voters."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8036,
    "fields": {
        "question": 4009,
        "description": "Our campaign is focused on winning key states and regions that will be decisive in the election. Some of these states include Arizona, Nevada, and New Mexico, which are growing in importance in national elections and are home to large and diverse populations. We are also focusing on the West Coast and the Pacific Northwest, where our message of progressive change and social justice will resonate with voters."
    }
}, {
    "model": "campaign_trail.answer",
    "pk": 8037,
    "fields": {
        "question": 4009,
        "description": "We are focused on winning key states and regions that will be crucial to our electoral success. Some of these states include Virginia, North Carolina, and Georgia, which are growing in importance in national elections and are home to large and diverse populations. We are also focusing on the Southeast and the Gulf Coast, where our message of economic fairness and political reform will resonate with voters."
    }
}]